In [1]:
import sqlite3

In [3]:
conn = sqlite3.connect('create.db')

In [4]:
cur = conn.cursor()

In [7]:
sql = """create table person(
    first_name text primary key not null,
    last_name text not null
);

insert into person values('first', 'last');
"""

In [11]:
cur.execute("""insert into person values('first', 'last');""")

In [13]:
conn.commit()

In [14]:
cur.execute('select * from person;')

In [15]:
cur.fetchall()

[('first', 'last')]

In [17]:
cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY    NOT NULL,
        NAME           TEXT   NOT NULL,
        AGE            INT    NOT NULL,
        ADDRESS        CHAR(50),
        SALARY         REAL);
''')

In [18]:
cur.executescript('''
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'A',25,'B',65000.00);
    
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'C',25,'D',65000.00);
''')

---

In [20]:
conn = sqlite3.connect('create3.db')

In [21]:
cur = conn.cursor()

In [22]:
print("Opened database successfully")

cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY    NOT NULL,
        NAME           TEXT   NOT NULL,
        AGE            INT    NOT NULL,
        ADDRESS        CHAR(50),
        SALARY         REAL);
        ''')

print("Table created successfully")

Opened database successfully
Table created successfully

In [23]:
cur.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
              VALUES (1, 'Paul',32, 'California', 20000.00)");

In [24]:
cur.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
              VALUES (:id, :name, :age, :address, :salary)",
              {'id':2, 'name':'Allen','age':25, 'address':'Texas', 'salary':15000.00});

In [25]:
data = [(3, 'Teddy',23,'Norway', 200000.00),
        (4, 'Mark',25,'Rich-Mond', 65000.00)]

In [26]:
cur.executemany("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
                  VALUES (?,?,?,?,?)",data)

In [27]:
cur.executescript('''
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'A',25,'B',65000.00);
    
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'C',25,'D',65000.00);
    
    ''')

In [ ]:
cur.lastrowid

In [29]:
conn.commit()

In [36]:
cur.execute('select * from company')

In [37]:
for row in cur:
    print(row[0], row[1], row[2], row[3], row[4])
    print(type(row[0]), type(row[1]), type(row[2]), type(row[3]), type(row[4]))

1 Paul 32 California 20000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>
2 Allen 25 Texas 15000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>
3 Teddy 23 Norway 200000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>
4 Mark 25 Rich-Mond 65000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>
5 A 25 B 65000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>
6 C 25 D 65000.0
<class 'int'> <class 'str'> <class 'int'> <class 'str'> <class 'float'>

In [38]:
cur.lastrowid

6

In [39]:
conn.total_changes

6

In [42]:
conn = sqlite3.connect('create4.db')

In [43]:
cur = conn.cursor()

In [44]:
print("Opened database successfully")

cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY    NOT NULL,
        NAME           TEXT   NOT NULL,
        AGE            INT    NOT NULL,
        ADDRESS        CHAR(50),
        SALARY         REAL);
        ''')

print("Table created successfully")

Opened database successfully
Table created successfully

In [45]:
cur.lastrowid

0

In [46]:
cur.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
              VALUES (1, 'Paul',32, 'California', 20000.00)");

In [47]:
cur.lastrowid

1

In [48]:
conn.commit()

In [49]:
cur.lastrowid, conn.total_changes

1

In [51]:
cur.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
              VALUES (:id, :name, :age, :address, :salary)",
              {'id':2, 'name':'Allen','age':25, 'address':'Texas', 'salary':15000.00});

In [52]:
cur.lastrowid, conn.total_changes

(2, 2)

In [53]:
data = [(3, 'Teddy',23,'Norway', 200000.00),
        (4, 'Mark',25,'Rich-Mond', 65000.00)]

In [54]:
cur.executemany("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
                  VALUES (?,?,?,?,?)",data)

In [55]:
cur.lastrowid, conn.total_changes

(2, 4)

In [56]:
cur.executescript('''
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'A',25,'B',65000.00);
    
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'C',25,'D',65000.00);
    
    ''')

In [57]:
cur.lastrowid, conn.total_changes

(2, 6)

In [60]:
cur.execute('select * from company;')

In [61]:
for row in cur:
    print(row[0], row[1], row[2], row[3], row[4])

1 Paul 32 California 20000.0
2 Allen 25 Texas 15000.0
3 Teddy 23 Norway 200000.0
4 Mark 25 Rich-Mond 65000.0
5 A 25 B 65000.0
6 C 25 D 65000.0

In [62]:
cur.lastrowid

6

In [64]:
cur.execute('UPDATE COMPANY set SALARY = 25000.00 where ID = :id', {'id': 1})

In [65]:
cur.lastrowid

6

In [66]:
conn.commit()

In [67]:
conn.total_changes

7

In [69]:
cur.execute('DELETE from COMPANY where ID = :id', {'id': 2})

In [70]:
conn.commit()